Revit 2027 API
GroupSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual GroupSetIterator ForwardIterator()
Public Overridable Function ForwardIterator As GroupSetIterator
public:
virtual GroupSetIterator^ ForwardIterator()
abstract ForwardIterator : unit -> GroupSetIterator
override ForwardIterator : unit -> GroupSetIterator
Return Value
GroupSetIterator
Returns a forward moving iterator to the set.
See Also
Reference
GroupSet Class
Autodesk.Revit.DB Namespace